[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Data Visualisation Blog",
    "description": "Welcome to our new blog, My Data Visualisation Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-17",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-17T18:37:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This visualisation presents the growth of Singapore's Labour Force Participation Rate (LFPR) from 2009 to 2019.",
    "author": [
      {
        "name": "Andy WONG",
        "url": "https://www.linkedin.com/in/andywongkh"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nThe data visualisation is published on Tableau Public.\r\n1.1 Clarity vs aesthetics\r\nThe original chart is presented below:\r\nSource: https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspxIn terms of aesthetics, the chart above looks acceptable. Font styles and colour schemes are easy on the eyes.\r\nHowever, the presentation of the data itself could be clearer.\r\nBased on this assessment, the chart falls into Quadrant IV of the matrix:\r\nSource of clarity vs aesthetics matrix: https://dataremixed.com/2012/05/data-visualization-clarity-or-aesthetics2.0 Makeover\r\n2.1 Critique of the visualisation, and suggested improvements\r\n2.1.1 Clarity\r\nS/n\r\nCritique\r\nSuggestions for improvement\r\n1\r\nUnclear subtitle. It is not clear what the subtitle “Per Cent” refers to. It almost looks to be put there as an afterthought.\r\nRemove the subtitle and label the appropriate axis with “%”. This will eliminate uncessary text, yet present the percentage values in a more intuitive manner.\r\n2\r\nThe x-axis is not explained. There are no labels to explain what the three types of values on the x-axis mean.\r\nPivot the data such that the percentages are on the x-axis and the age group is on the y-axis, and label the axes accordingly. This will improve the clarity of the visualisation.\r\n3\r\nAge Group is not presented clearly. Compounded with the blue and grey lines of the line graph, it looked as though a timeline was being presented. Only upon further examination was it understood to be a presentation of the proportion of age group in percentage.\r\nPivot the data such that age group is presented on the y-axis. This will improve the intuitiveness of the visualisation.\r\n4\r\nDuplicate presentation of information. The two lines of the line graph essentially present the same information as the percentage values in the x-axis. The line graph presents the trend visually, while the x-axis provides the actual percentage values. This duplication would not be needed with better visualization design.\r\nRemove the June 2009 and June 2019 percentage values from the x-axis. This will no longer be necessary once the data is presented appropriately.\r\n2.1.2 Aesthetics\r\nS/n\r\nCritique\r\nSuggestions for improvement\r\n1\r\nGood use of colour to differentiate the two time periods. A more contrasting colour scheme might be better.\r\nUse more appealing colours to enhance the contrast and clarity of the two sets of data being compared.\r\n2\r\nClear labeling of what the two lines in the line graph represent, and the median ages. However, better designed aesthetics could allow for more concise labeling (using less words).\r\nInclude labels as necessary to improve conciseness and clarity.\r\n3\r\nWith thee different values, the x-axis is too cluttered.\r\nThis will be solved once the data is pivoted appropriately, as mentioned in section 2.1.1.\r\n4\r\nA minor point: although best practice states that number ranges should start from 0, there is no need for the age group to start from 0 in this case, as this graph is meant to present the labour force which consists of only persons aged 15 years and over. The age groups presented covers the entire range of legal working age ranges.\r\nNo action necessary.\r\n2.2 Sketch of the alternative visualisation\r\nThe sketch below is the proposed improved visualisation to address the critique presented in section 2.1.\r\nProposed visualisation2.3 Building the visualisation\r\nThis visualisation was built using Tableau Desktop Professional Edition 2020.4.0.\r\nStep 1. Import data into TableauImport Excel file into Tableau.Step 2. The data is not standardised and cleaned because the formatting of the spreadsheet is not friendly for data importation.Step 3. Clean the dataClick on the “Cleaned with Data Interpreter” to provide an initial clean-up of the data to allow for easier manual cleaning.Step 4. Hide uneccessary columnsHide the left-most column as it is not useful for this analysis.Step 5. Rename columnsRename the “Age (Years) 1” column to “Age Group” for clarity.Step 6. Check data type Age columnCheck that the “Age” column is of the correct data type (String).Step 7. Check data type of year columnsCheck that the rest of the year columns are of the correct data type (Number[decimal]).Step 8. Define Column and Row dataDrag “2009” and “2019” to the Columns pane and “Age Group” to the Rows pane.Step 9. Exclude irrelevant columnsExclude the “NULL” and “Total” columns from the chart as these are not useful for the analysis.  Step 10. Exclude overlapping age groupExclude the overlapping age groups, as these will confuse the data presented in the visualisation.Step 11. Sort Age GroupSort “Age Group” in descending order.  Step 12. Superimpose the two chartsSelect “Dual Axis” to combine the two charts into one.Step 13. Synchronise the two y-axesSelect “Synchronise Axis” to ensure both charts’ y-axes match.Step 14. Remove headerRemove “Show Header” to show only one y-axis.Step 15. Change visualisation for 2019 chartChange the 2019 Mark to Bar chart.Step 16. Reorder 2019 and 2009 chartsSwap “SUM(2019)” to the front of the Columns pane to display the 2019 chart behind the 2009 chart.Step 17. Show whole range of x-axisEdit the range of the x-axis to show the whole range of 0% to 100%. Rename label as “LFPR (%)”.Step 18. Expand chart viewChange the view to “Entire View” for visual clarity.Step 19. Edit chart titleStep 20. Edit Legend titleEdit the Legend title to “Year”.Step 21. Rename the SheetStep 22. Completed visualisationThe completed chart looks like this:\r\n2.4 Key observations from the visualisation\r\nS/n\r\nObservation\r\n1\r\nThe largest increase in LFPR from 2009 to 2019 was among the 50 to 64, and 65 to 69 age groups. This kind of shift in LFPR was to be expected of an ageing population as more older workers joined the workforce than their younger counterparts.\r\n2\r\nThe 25 to 29 age group had the highest LFPR in 2009. Ten years later in 2019, the age group with the highest LFPR was 30 to 34, which was one age group younger than the original 25 to 29 age group. The showed that from 2009 to 2019, the age group with the highest LFPR moved down by one group. The reason for this trend is outside the scope of this analysis but is a potential area of interest for further study.\r\n3\r\nOf all the age groups, only the 20 to 24 age group declined in LFPR from 2009 to 2019. This was the only exception among all the age groups. As this was typically the age group of university undergraduates, it may have signified that more people in this age group were attending university. However, this point warrants further study.\r\n4\r\nOverall, the lower the age group, the slower the increase in LFPR from 2009 to 2019, with the exception of the 15 to 19 age group, which seemed to reverse the trend compared to the next older age group (20 to 24). This seemed to contradict Singapore’s Total Fertility Rate (TFR) which has been declining consistently, but may have been bolstered by the slight up-tick in TFR in 2000.\r\nThanks for visiting my blog!\r\nThis post is a data visualisation assignment for the MITB programme at the Singapore Management University.   Distill is a publication format for scientific and technical writing, native to the web. Learn more about using Distill at https://rstudio.github.io/distill. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-17T19:53:05+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
